app/controllers/accounts_controller.rb

    def index
        @accounts= Account.order('created_at DESC')
---
SELECT "accounts".* FROM "accounts" ORDER BY created_at DESC
SELECT COUNT(*) FROM "accounts"

    def create
        @account = Account.new(account_params)

        if @account.save
---
INSERT INTO "accounts" ("name", "created_at", "updated_at", "workflow_state", "deleted_at", "parent_account_id", "sis_source_id", "sis_batch_id", "current_sis_batch_id", "root_account_id", "last_successful_sis_batch_id", "membership_types", "default_time_zone", "external_status", "storage_quota", "default_storage_quota", "enable_user_notes", "allowed_services", "turnitin_pledge", "turnitin_comments", "turnitin_account_id", "turnitin_salt", "turnitin_crypted_secret", "show_section_name_as_course_name", "allow_sis_import", "equella_endpoint", "settings", "uuid", "default_locale", "stuck_sis_fields", "default_user_storage_quota", "lti_guid", "default_group_storage_quota", "turnitin_host", "integration_id", "lti_context_id", "brand_config_md5", "turnitin_originality", "account_calendar_subscription_type", "latest_outcome_import_id", "course_template_id", "account_calendar_visible", "grading_standard_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43) RETURNING "id"

    def show
        @courses = @account.courses.order('created_at DESC')
---
SELECT "courses".* FROM "courses" WHERE "courses"."account_id" = $1 ORDER BY created_at DESC  [["account_id", 3]]

    def update
        if @account.update(account_params)
---
UPDATE "accounts" SET "name" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["name", "Mario"], ["updated_at", "2024-07-19 16:29:03.852653"], ["id", 7]]