app/controllers/assignments_controller.rb

UPDATE "assignments" SET "description" = $1, "updated_at" = $2 WHERE "assignments"."id" = $3  [["description", "\nejercicios\nde matematicas"], ["updated_at", "2024-07-28 20:57:04.582521"], ["id", 4]]
---
  def update
    if @assignment.update(assignment_params)

DELETE FROM "assignments" WHERE "assignments"."id" = $1  [["id", 3]]
---
  def destroy
    if @assignment.destroy

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."account_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["account_id", 15], ["id", 33], ["LIMIT", 1]]
---
  def set_course
    @account = Account.find(params[:account_id])
    @course = @account.courses.find(params[:course_id])