app/controllers/courses_controller.rb

  def index
    @courses = @account.courses.order('created_at DESC')
---
SELECT "courses".* FROM "courses" WHERE "courses"."account_id" = $1 ORDER BY created_at DESC  [["account_id", 4]]
SELECT COUNT(*) FROM "courses" WHERE "courses"."account_id" = $1  [["account_id", 4]]

  def create
    @course = @account.courses.build(course_params.merge(workflow_state: @account.workflow_state))
    if @course.save
---
INSERT INTO "courses" ("name", "account_id", "group_weighting_scheme", "workflow_state", "uuid", "start_at", "conclude_at", "grading_standard_id", "is_public", "allow_student_wiki_edits", "created_at", "updated_at", "show_public_context_messages", "syllabus_body", "allow_student_forum_attachments", "default_wiki_editing_roles", "wiki_id", "allow_student_organized_groups", "course_code", "default_view", "abstract_course_id", "root_account_id", "enrollment_term_id", "sis_source_id", "sis_batch_id", "open_enrollment", "storage_quota", "tab_configuration", "allow_wiki_comments", "turnitin_comments", "self_enrollment", "license", "indexed", "restrict_enrollments_to_course_dates", "template_course_id", "locale", "settings", "replacement_course_id", "stuck_sis_fields", "public_description", "self_enrollment_code", "self_enrollment_limit", "integration_id", "time_zone", "lti_context_id", "turnitin_id", "show_announcements_on_home_page", "home_page_announcement_limit", "latest_outcome_import_id", "grade_passback_setting", "template", "homeroom_course", "sync_enrollments_from_homeroom", "homeroom_course_id", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55) RETURNING "id"

  def update
    if @course.update(course_params)
---
UPDATE "courses" SET "updated_at" = $1, "course_code" = $2 WHERE "courses"."id" = $3  [["updated_at", "2024-07-28 20:54:48.524271"], ["course_code", "202002"], ["id", 33]]

  def destroy
    if @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 31]]

  def set_course
    @course = @account.courses.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."account_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["account_id", 15], ["id", 31], ["LIMIT", 1]]

  def set_account
    @account = Account.find(params[:account_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]